---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionEditType
source: html/95cadafd-a227-d91f-9e4b-ec67703618ef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionEditType Property

"Modify Parameters"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionEditType { get; }
```